environments/cfd/empty_project/system/fvOptions
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object fvOptions;
}
